//トークンなど機密事項やタイムゾーンはdotenvで管理すること！
//import config from '../config.mjs'; などで読み込む
export default {
    privatecategory: [//プライベートカテゴリのIDリスト
        "1128492964939833375",//クリエイターロール
        "1075366548329467964"//管理室
    ],
    logch: {//ログを取るチャンネル config.logch.xxx
      //個人鯖でとってるやつ
      login: "1260078780534231062",//botの起動
      error: "1260078895479263273",//エラー
      //実際の鯖あたりに置いてるやつ
      command: "1260078833936367679",//コマンドの使用
      admin:"1038840639460229202",//管理コマンド使用ログ、管理室などを推奨
      guildCreate: "1260078958460928061",
      guildDelete: "1260078958460928061"
    },
    timesignalch : "1025416223724404766",//時報を流すチャンネル
    moderator : "1038083096618209301", //モデレーターのロールID
    dominoch: "1288173544232194089",//ドミノ部屋、ドミノのログもここに出す
    reddice: [ // サイコロのリアクション（赤）0から9まで
        "1287340670008430646",//0
        "1287340678531125248",//1
        "1287340686798225450",//2
        "1287340693588672543",//3
        "1287340701612245023",//4
        "1287340709090824294",//5
        "1287340716967858267",//6
        "1287340724131729508",//7
        "1287340732490977311",//8
        "1287340739381956638"//9
    ],
    bluedice: [ // サイコロのリアクション（青）0から9まで
        "1287339237506813963",//0
        "1287339245895159832",//1
        "1287339259182972958",//2
        "1287339289880956948",//3
        "1287339301813878805",//4
        "1287339313184509992",//5
        "1287339322227294248",//6
        "1287339330536345642",//7
        "1287339338979348480",//8
        "1287339348609732661"//9
    ],
};