//トークンなど機密事項やタイムゾーンはdotenvで管理すること！
//import config from '../config.mjs'; などで読み込む
export default {
    privatecategory: [//プライベートカテゴリのIDリスト
        "1128492964939833375",//クリエイターロール
        "1075366548329467964"//管理室
    ],
    logch: {//ログを取るチャンネル config.logch.xxx
      //個人鯖でとってるやつ
      login: "1260078780534231062",//botの起動
      error: "1260078895479263273",//エラー
      //実際の鯖あたりに置いてるやつ
      command: "1263336102622793861",//コマンドの使用
      admin:"1038840639460229202",//管理コマンド使用ログ、管理室などを推奨
      guildCreate: "1260078958460928061",
      guildDelete: "1260078958460928061"
    },
    timesignalch : "1025416223724404766",//時報を流すチャンネル
    moderator : "1038083096618209301", //モデレーターのロールID
    dominoch: "1265171008088703016",//ドミノを並べたログを出すチャンネル
    reddice: [ // サイコロのリアクション（赤）0から9まで
        "1285864521948467233",//0
        "1285864535525163062",//1
        "1285864545755336745",//2
        "1285864554030694400",//3
        "1285864561936699413",//4
        "1285864569545166900",//5
        "1285864577367806050",//6
        "1285864585265549373",//7
        "1285864593507221514",//8
        "1285864601245974570"//9
    ],
    bluedice: [ // サイコロのリアクション（赤）0から9まで
        "1285864966091440129",//0
        "1285864973897302079",//1
        "1285864981451247672",//2
        "1285864990179590206",//3
        "1285864998152699904",//4
        "1285865007359197217",//5
        "1285865015508860979",//6
        "1285865023679365210",//7
        "1285865032659501087",//8
        "1285865040364310559"//9
    ],
};